backend/app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "salary", "position_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lucas"], ["salary", 1.0], ["position_id", 1], ["created_at", "2019-12-10 21:44:04.279641"], ["updated_at", "2019-12-10 21:44:04.279641"]]
---
  def create
    @employee = Employee.new(employee_params)

    if @employee.save

UPDATE "employees" SET "name" = $1, "salary" = $2, "updated_at" = $3 WHERE "employees"."id" = $4  [["name", "teste"], ["salary", 24.0], ["updated_at", "2019-12-12 01:21:40.970697"], ["id", 2]]
---
  def update
    if @employee.update(employee_params)