backend/app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"

  def create
    @position = Position.new(position_params)

    if @position.save
---
INSERT INTO "positions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "contador"], ["created_at", "2019-12-10 21:42:25.868959"], ["updated_at", "2019-12-10 21:42:25.868959"]]

  def update
    if @position.update(position_params)
---
UPDATE "positions" SET "name" = $1, "updated_at" = $2 WHERE "positions"."id" = $3  [["name", "contador numero um"], ["updated_at", "2019-12-12 01:52:33.443488"], ["id", 1]]

  def destroy
    @position.destroy
---
DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 2]]

    def set_position
      @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]