backend/app/controllers/users_controller.rb

  def update
    unless @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "teste"], ["updated_at", "2019-12-12 16:50:02.899714"], ["id", 1]]

  def find_user
    @user = User.find_by_username!(params[:_username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]